Autodesk.Revit.Creation.eRefFace
Indicates the reference face. The Opening will be created at the direction perpendicular to
the reference face.
Remarks: Direction of the opening.

Autodesk.Revit.Creation.eRefFace.CenterZ
The reference face is at the middle of the element in the direction
of z-axis and its normal is parallel to z-axis.

Autodesk.Revit.Creation.eRefFace.CenterY
The reference face is at the middle of the element in the direction
of y-axis and its normal is parallel to y-axis.

Autodesk.Revit.Creation.eRefFace.CenterX
The reference face is at the middle of the element in the direction
of x-axis and its normal is parallel to x-axis.